In [311]:
import numpy as np
import pandas as pd

**1\.** Как создать pd.Series из листа, numpy array и словаря(dict)? (★☆☆)

In [312]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

print(pd.Series(mylist))
print(pd.Series(myarr))
print(pd.Series(mydict))

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int32
a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

**2\.** Как сделать превратить индексы из датафрейма в колонку? (★☆☆)

In [313]:
df=pd.DataFrame(['a', 'b', 'c'])

df['index'] = df.index
df

   0  index
0  a      0
1  b      1
2  c      2

**3\.** Как из нескольких pd.Series сделать один датафрейм? (★★☆)

(hint: pd.concat или словарь с колонками)

In [314]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['aa', 'b1', 'c2'])
df3=pd.Series(['44', '55', '66'])

pd.concat([df1, df2, df3], axis=1)

   0   1   2
0  a  aa  44
1  b  b1  55
2  c  c2  66

**4\.** Как получить строки из series A, которые не содержатся в series B? (★★☆)

In [315]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['a', 'b1', 'c2'])

df1[~df1.isin(df2)]

1    b
2    c
dtype: object

**5\.** Как получить из series/dataframe минимум, 25й персентиль, медиану, 75тый персентиль, максимум? (★☆☆)

(hint: использовать одну команду)

In [316]:
df1=pd.Series(np.arange(10, 99))

np.percentile(df1, [25, 50, 75, 100])

array([32., 54., 76., 98.])

**6\.** Как получить частоту\долю для всех уникальных объектов в series? (★☆☆)

In [317]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

np.unique(df1, return_counts=True)

(array(['a', 'b', 'c', 'g', 'u', 'v'], dtype=object),
 array([5, 2, 3, 1, 1, 1], dtype=int64))

**7\.** Как оставить только топ-2 самых часто встречающихся значений, а все остальные значения заменить на 'other'?  (★★☆)

In [318]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

a = df1.value_counts()[:2].index.tolist()
df1[~df1.isin(a) ] = 'other'
df1

0         a
1     other
2         c
3     other
4     other
5         a
6         a
7         a
8     other
9         a
10    other
11        c
12        c
dtype: object

**8\.** Как разбить колонку с числовыми значениями на 10 групп одинакового размера?  (★★☆)

(hint: pd.qcut)

In [319]:
s = pd.Series(np.random.random(20))
pd.qcut(s, 10)

0      (0.553, 0.594]
1      (0.311, 0.475]
2      (0.207, 0.311]
3      (0.475, 0.518]
4      (0.667, 0.701]
5      (0.594, 0.667]
6      (0.518, 0.553]
7      (0.701, 0.839]
8      (0.475, 0.518]
9       (0.839, 0.85]
10     (0.311, 0.475]
11    (0.0716, 0.207]
12      (0.839, 0.85]
13     (0.207, 0.311]
14     (0.701, 0.839]
15    (0.0716, 0.207]
16     (0.594, 0.667]
17     (0.518, 0.553]
18     (0.553, 0.594]
19     (0.667, 0.701]
dtype: category
Categories (10, interval[float64]): [(0.0716, 0.207] < (0.207, 0.311] < (0.311, 0.475] < (0.475, 0.518] ... (0.594, 0.667] < (0.667, 0.701] < (0.701, 0.839] < (0.839, 0.85]]

**9\.** Как найти позиции чисел, которые делятся на 3 без остатка из series?  (★★☆)

(можно с помощью numpy и с помощью pandas)

In [320]:
s = pd.Series([1, 2, 3, 4, 5, 6, 7])

s[s % 3 == 0].index

Int64Index([2, 5], dtype='int64')

**10\.** Как извлечь из series строки по индексам?  (★☆☆)

In [321]:
s = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

s[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

**11\.** Как сделать stack двух series вертикально и горизонтально? (★☆☆)

(hint: pd.append, pd.concat)

In [322]:
s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

print(pd.concat([s1, s2]))
print(pd.concat([s1, s2], axis=1))

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

**12\.** Как получить позиции строк из series A из другого series B? (★☆☆)

(можно с помощью numpy и с помощью pandas)

In [323]:
s1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
s2 = pd.Series([1, 3, 10, 13])

s1 = pd.Series(s1.index, s1.values)
s1[s2].values

array([5, 4, 0, 8], dtype=int64)

**13\.** Как вычислить среднеквадратическую ошибку для истинных и предсказанных значений? (★★☆)

In [324]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

((truth - pred) ** 2).mean()

0.34260969679339404

**14\.** Как конвертировать каждый первый элемент строке в series в верхний регистр? (★★☆)

In [325]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

s.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

**15\.** Как посчитать количество символов в каждой строке? (★★☆)

In [326]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

s.str.len()

0    3
1    2
2    4
3    4
dtype: int64

**16\.** Как преобразовать даты в виде строк в timeseries?  (★☆☆)

(hint: pd.to_datetime)

In [327]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

pd.to_datetime(s)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

**17\.** Как получить день месяца, номер недели, день года и день недели из даты в виде строки? (★★☆)

In [328]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

date = pd.to_datetime(s)

print("Date: ", date.dt.day)

print("Week number: ", date.dt.weekofyear)

print("Day number of year: ", date.dt.dayofyear)

print("Day of week: ", date.dt.dayofweek)

Date:  0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
Week number:  0    53
1     5
2     9
3    14
4    19
5    23
dtype: int64
Day number of year:  0      1
1     33
2     63
3     94
4    125
5    157
dtype: int64
Day of week:  0    4
1    2
2    5
3    3
4    0
5    5
dtype: int64

<ipython-input-328-3b1c1bec8473>:7: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  print("Week number: ", date.dt.weekofyear)

**18\.** Как конвертировать дату из формата месяц-год в формат год-месяц-первое число? (★★☆)

(hint: .strftime('%Y-%m-%d'))

In [329]:
s = pd.Series(['Jan 2017', 'Feb 2019', 'Mar 2012'])

d = pd.to_datetime(s).dt.strftime('%Y-%m-%d')
d

0    2017-01-01
1    2019-02-01
2    2012-03-01
dtype: object

**19\.** Как отфильтровать слова, содержащие не менее 2 гласных? (★★☆)

In [330]:
s = pd.Series(['Kitty', 'Cat', 'Plan', 'Python', 'Money'])

s_l = s.str.lower()
s[s_l.str.count('a|e|i|o|u|y') >= 2]

0     Kitty
3    Python
4     Money
dtype: object

**20\.** Заполните все пропущенные даты от минимальной до максимальной, значения при этом дожны быть равны предыдущей не пропущеной дате (★★★)

In [331]:
s = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

s.resample('D').pad()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

**21\.** Считайте файл из CSV-файла по строчно и добавьте считанные строки в датафрейм (файл data/BostonHousing.csv)?  (★★☆)

(hint: csv reader)

In [332]:
from csv import reader
with open('BostonHousing.csv', newline='') as file:
    r = reader(file)
    index = data = None
    for row in r:
        if data is None:
            index = row
            data = []
        else:
            data.append(row)

df = pd.DataFrame(data, columns=index)
df

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18,2.31,0,0.538,6.575,65.2,4.09,1,296,15.3,396.9,4.98,24
1,0.02731,0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.9,9.14,21.6
2,0.02729,0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.9,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21,391.99,9.67,22.4
502,0.04527,0,11.93,0,0.573,6.12,76.7,2.2875,1,273,21,396.9,9.08,20.6
503,0.06076,0,11.93,0,0.573,6.976,91,2.1675,1,273,21,396.9,5.64,23.9
504,0.10959,0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21,393.45,6.48,22
505,0.04741,0,11.93,0,0.573,6.03,80.8,2.505,1,273,21,396.9,7.88,11.9

**22\.** Как изменить значения столбца при импорте csv в фрейм данных?
Импортируйте датасет с помощью pd.read_csv, но колонку 'medv' (median house value) измените так, что если value < 25 = ‘Low’ и если > 25 = ‘High’.  (★★☆)

(hint: pd.read_csv(....., converts={}))

In [333]:
pd.read_csv('.\BostonHousing.csv',
            converters={'medv': lambda medved: 'Low' if float(medved) < 25 else 'High'})

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,Low
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,Low
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,Low
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,Low
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,Low

**23\.** Как импортировать только указанные столбцы('crim' и 'medv') и только n строк из CSV-файла?  (★☆☆)

In [334]:
n = 10
pd.read_csv('.\BostonHousing.csv', usecols=['crim', 'medv'], nrows=n)

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2
5  0.02985  28.7
6  0.08829  22.9
7  0.14455  27.1
8  0.21124  16.5
9  0.17004  18.9

**24\.** Как получить кол-во строк, кол-во столбцов, тип столбцов, кол-во столбцов с таким типом данных, итоговую статистику каждого столбца датафрейма?  (★☆☆)

In [335]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#  number of rows and columns
print(df.shape)
# datatypes
print(df.dtypes)
# how many columns under each dtype
print(df.dtypes.value_counts())
# summary statistics
df.describe()

(93, 27)
Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object
float64    18
object      9
dtype: int64

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
count,86.000000,91.000000,88.000000,84.000000,91.000000,91.000000,86.000000,90.000000,87.000000,85.000000,91.000000,89.000000,92.000000,87.000000,88.000000,89.000000,74.000000,86.000000
mean,17.118605,19.616484,21.459091,22.404762,29.065934,2.658242,144.000000,5276.666667,2355.000000,16.683529,5.076923,182.865169,103.956522,69.448276,38.954545,27.853933,13.986486,3104.593023
std,8.828290,9.724280,10.696563,5.841520,5.370293,1.045845,53.455204,605.554811,486.916616,3.375748,1.045953,14.792651,6.856317,3.778023,3.304157,3.018129,3.120824,600.129993
min,6.700000,7.400000,7.900000,15.000000,20.000000,1.000000,55.000000,3800.000000,1320.000000,9.200000,2.000000,141.000000,90.000000,60.000000,32.000000,19.000000,6.000000,1695.000000
25%,10.825000,12.350000,14.575000,18.000000,26.000000,1.800000,100.750000,4800.000000,2017.500000,14.500000,4.000000,174.000000,98.000000,67.000000,36.000000,26.000000,12.000000,2647.500000
50%,14.600000,17.700000,19.150000,21.000000,28.000000,2.300000,140.000000,5200.000000,2360.000000,16.500000,5.000000,181.000000,103.000000,69.000000,39.000000,27.500000,14.000000,3085.000000
75%,20.250000,23.500000,24.825000,25.000000,31.000000,3.250000,170.000000,5787.500000,2565.000000,19.000000,6.000000,192.000000,110.000000,72.000000,42.000000,30.000000,16.000000,3567.500000
max,45.400000,61.900000,80.000000,46.000000,50.000000,5.700000,300.000000,6500.000000,3755.000000,27.000000,8.000000,219.000000,119.000000,78.000000,45.000000,36.000000,22.000000,4105.000000

**25\.** Как извлечь номер строки и столбца конкретной ячейки с заданным критерием? (★☆☆)

In [336]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Get Manufacturer with highest price
manufacturer = df.loc[df['Price'].idxmax()]['Manufacturer']
print(manufacturer)
# Get Row and Column number
print(df['Price'].idxmax())
print(df.columns.get_loc('Price'))
# Get the value
df.loc[df['Price'].idxmax()]['Price']

Mercedes-Benz
58
4

61.9

**26\.** Переименнуйте колонку Type в CarType, в столбцах с '.' в названии замените её на '_'. Как добавить ко всем названиям колонок суффиксы?  (★☆☆)

In [337]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df = df.rename(columns={'Type': 'CarType'})
df.columns = df.columns.str.replace('.', '_')
df.add_suffix('s')
df

<ipython-input-337-bc073c6dba7a>:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.replace('.', '_')

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17.0,21.0,None,Front,...,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,22.4,21.0,30.0,None,Front,...,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18.0,25.0,None,Front,...,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,23.5,21.0,28.0,Driver only,Rear,...,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,28.5,20.0,28.0,Driver & Passenger,Front,...,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0,non-USA,Volvo 850

**27\.** Проверьте есть ли в датафрейме пропуски? Если да, посчитайте кол-во nan\none в каждом столбце датафрейма  (★★☆)

In [338]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df.isna().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

**28\.** Как заменить отсутствующие значения нескольких числовых столбцов средним?  (★★☆)

In [339]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df.fillna(df.mean())

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.800000,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.000000,37.0,26.5,13.986486,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.700000,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.000000,38.0,30.0,15.000000,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.300000,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.000000,37.0,28.0,14.000000,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.600000,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,69.448276,37.0,31.0,17.000000,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,21.459091,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.000000,39.0,27.0,13.000000,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.600000,19.7,22.700000,17.0,21.0,None,Front,...,7.0,187.0,115.0,72.000000,38.0,34.0,13.986486,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.600000,20.0,22.400000,21.0,30.0,None,Front,...,5.0,180.0,103.0,67.000000,35.0,31.5,14.000000,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.900000,23.3,23.700000,18.0,25.0,None,Front,...,4.0,159.0,97.0,66.000000,36.0,26.0,15.000000,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.800000,22.7,23.500000,21.0,28.0,Driver only,Rear,...,5.0,190.0,104.0,67.000000,37.0,29.5,14.000000,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.800000,26.7,28.500000,20.0,28.0,Driver & Passenger,Front,...,5.0,184.0,105.0,69.000000,38.0,30.0,15.000000,3245.0,non-USA,Volvo 850

**29\.** Как выбрать конкретный столбец из датафрейма в качестве датафрейма, а не series?  (★☆☆)

In [340]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

dfdf = df[['Manufacturer']]
dfdf

   Manufacturer
0         Acura
1           NaN
2          Audi
3          Audi
4           BMW
..          ...
88   Volkswagen
89   Volkswagen
90   Volkswagen
91        Volvo
92          NaN

[93 rows x 1 columns]

In [341]:
print(type(dfdf))

<class 'pandas.core.frame.DataFrame'>

**30\.** Как изменить порядок столбцов данных? (☆☆☆)

In [342]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

columns = df.columns.to_list()
print(columns)
np.random.shuffle(columns)
print(columns)
df[columns]

['Manufacturer', 'Model', 'Type', 'Min.Price', 'Price', 'Max.Price', 'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders', 'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail', 'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width', 'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin', 'Make']
['Rear.seat.room', 'Weight', 'Price', 'Horsepower', 'Min.Price', 'Turn.circle', 'Passengers', 'Cylinders', 'Max.Price', 'MPG.highway', 'Width', 'Wheelbase', 'Type', 'Make', 'AirBags', 'Model', 'MPG.city', 'Length', 'RPM', 'Luggage.room', 'Rev.per.mile', 'Origin', 'Manufacturer', 'Fuel.tank.capacity', 'DriveTrain', 'EngineSize', 'Man.trans.avail']

,Rear.seat.room,Weight,Price,Horsepower,Min.Price,Turn.circle,Passengers,Cylinders,Max.Price,MPG.highway,...,Length,RPM,Luggage.room,Rev.per.mile,Origin,Manufacturer,Fuel.tank.capacity,DriveTrain,EngineSize,Man.trans.avail
0,26.5,2705.0,15.9,140.0,12.9,37.0,5.0,4,18.8,31.0,...,177.0,6300.0,NaN,2890.0,non-USA,Acura,13.2,Front,1.8,Yes
1,30.0,3560.0,33.9,200.0,29.2,38.0,5.0,6,38.7,25.0,...,195.0,5500.0,15.0,2335.0,non-USA,NaN,18.0,Front,3.2,Yes
2,28.0,3375.0,29.1,172.0,25.9,37.0,5.0,6,32.3,26.0,...,180.0,5500.0,14.0,2280.0,non-USA,Audi,16.9,Front,2.8,Yes
3,31.0,3405.0,37.7,172.0,NaN,37.0,6.0,6,44.6,26.0,...,193.0,5500.0,17.0,2535.0,non-USA,Audi,21.1,NaN,NaN,NaN
4,27.0,3640.0,30.0,208.0,NaN,39.0,4.0,4,NaN,30.0,...,186.0,5700.0,13.0,2545.0,non-USA,BMW,21.1,Rear,3.5,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,34.0,3960.0,19.7,109.0,16.6,38.0,7.0,5,22.7,21.0,...,187.0,4500.0,NaN,2915.0,NaN,Volkswagen,21.1,Front,2.5,Yes
89,31.5,2985.0,20.0,134.0,17.6,35.0,5.0,4,22.4,30.0,...,180.0,5800.0,14.0,2685.0,non-USA,Volkswagen,18.5,Front,2.0,Yes
90,26.0,2810.0,23.3,178.0,22.9,36.0,4.0,6,23.7,25.0,...,159.0,5800.0,15.0,2385.0,non-USA,Volkswagen,18.5,Front,2.8,Yes
91,29.5,2985.0,22.7,114.0,21.8,37.0,5.0,NaN,23.5,28.0,...,190.0,5400.0,14.0,2215.0,non-USA,Volvo,15.8,Rear,2.3,Yes
92,30.0,3245.0,26.7,168.0,24.8,38.0,5.0,5,28.5,28.0,...,184.0,6200.0,15.0,NaN,non-USA,NaN,19.3,Front,2.4,Yes

**31\.** Как установить количество строк и столбцов, отображаемых в выводе? (☆☆☆)

(hint: pd.set_option)

In [343]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

pd.options.display.max_rows = 10
pd.options.display.max_columns = 10
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

**32\.** Как получить номер строки, в которой содержится максимальное значение в столбце? (★★☆)

In [344]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

print(df.idxmax())
df

a    9
b    1
c    1
dtype: int64

    a   b   c
0  20   5  19
1  10  24  21
2   6   3  18
3   7  17   4
4   1  14   7
5  18  19  16
6   8  24   5
7   2  16  12
8  21   7  17
9  22  17   6

**33\.** Как получить последние n строк датафрейма с суммой строк 100?  (★★★)

In [345]:
df = pd.DataFrame([[50,50],[50,25],[51,49],[33,67],[50,50],[50,25]])
print(df)
n = 2
df[df.sum(axis=1) == 100].tail(n)

    0   1
0  50  50
1  50  25
2  51  49
3  33  67
4  50  50
5  50  25

    0   1
3  33  67
4  50  50

### Выбросы (оutliers)

* 5 Ways to Detect Outliers/Anomalies That Every Data Scientist Should Know (Python Code)

https://towardsdatascience.com/5-ways-to-detect-outliers-that-every-data-scientist-should-know-python-code-70a54335a623

**34\.** Как найти и заменить выбросы из столбца Series или датафрейма? (★★★)

Замените все значения из столбца ниже 5того и больше 95го персентиля, на пограничные значения.

(hint: .quantile())

In [346]:
s = pd.Series(np.logspace(-2, 2, 30))

p5, p95 = np.quantile(s, [0.05, 0.95])
print(p5, p95)
s[s < p5] = p5
s[s > p95] = p95
s

0.016049294076965887 63.876672220183934

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
        ...
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
Length: 30, dtype: float64

**35\.** Попробуйте реализовать метод Interquartile Range (IQR) (★★★)

Почитать про него можно по ссылке выше.

In [347]:
s = pd.Series(np.logspace(-2, 2, 30))

def IQR(series, need_outliners=False):
    q1, q3 = np.quantile(s, [0.25, 0.75])

    iqr = q3 - q1

    if not need_outliners:
        no_outliers = series[(series > q1 - 1.5 * iqr) & (series < q3 + 1.5 * iqr)]
        return no_outliers
    else:
        outliers = series[(series <= q1 - 1.5 * iqr) | (series >= q3 + 1.5 * iqr)]
        return outliers

print(IQR(s))
print(IQR(s, True))

0      0.010000
1      0.013738
2      0.018874
3      0.025929
4      0.035622
        ...
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
Length: 25, dtype: float64
25     28.072162
26     38.566204
27     52.983169
28     72.789538
29    100.000000
dtype: float64

**36\.** Как поменять местами две строки данных? (★★★)

In [348]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [349]:
row0, row1 = df.iloc[0].copy(), df.iloc[1].copy()
df.iloc[0], df.iloc[1] = row1, row0
df

    0   1   2   3   4
0   5   6   7   8   9
1   0   1   2   3   4
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

### one-hot-encoding

**37\.** Как создать однозначные кодировки категориальной переменной? (★★★)

Сделайте one-hot кодировку столбца 'a'.

In [350]:
df = pd.DataFrame([['aa', 'kek'], ['ba', 'lol'], ['ab', 'kek'], ['aa', 'lol'], ['cc', 'kek']], columns=['a', 'b'])

df = pd.get_dummies(df, columns=['a'])
df

     b  a_aa  a_ab  a_ba  a_cc
0  kek     1     0     0     0
1  lol     0     0     1     0
2  kek     0     1     0     0
3  lol     1     0     0     0
4  kek     0     0     0     1

**38\.** Нормализуйте все столбцы в датафрейме. (★★★)

a) Нормализовать все столбцы df путем вычитания среднего значения столбца и деления на стандартное отклонение. 

b) Трансформируйте все столбцы df так, чтобы минимальное значение в каждом столбце было 0, а max = 1.

In [351]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

df

    0   1   2   3   4   5   6   7   8   9
0  46  49  37  27   5  15  42  59  81   3
1  30  82  18  92  23  25   7  61  90  73
2   8  84  22  25  20  36  56   8  15  80
3  41  32  33  11  75  80  52  68  64  68
4  75   8  36  83  92  97  30   1  35  97
5  62  79  97  25  92  96   5  47  31  80
6  32  16  16  81  29  79  71  70  43  51
7  58  33  27  87  12  94  43  82  16  49

In [352]:
df = (df - df.mean()) / df.std()
df = (df - df.min()) / (df.max() - df.min())
df

,0,1,2,3,4,5,6,7,8,9
0,0.567164,0.539474,0.259259,0.197531,0.000000,0.000000,0.560606,0.716049,0.880000,0.000000
1,0.328358,0.973684,0.024691,1.000000,0.206897,0.121951,0.030303,0.740741,1.000000,0.744681
2,0.000000,1.000000,0.074074,0.172840,0.172414,0.256098,0.772727,0.086420,0.000000,0.819149
3,0.492537,0.315789,0.209877,0.000000,0.804598,0.792683,0.712121,0.827160,0.653333,0.691489
4,1.000000,0.000000,0.246914,0.888889,1.000000,1.000000,0.378788,0.000000,0.266667,1.000000
5,0.805970,0.934211,1.000000,0.172840,1.000000,0.987805,0.000000,0.567901,0.213333,0.819149
6,0.358209,0.105263,0.000000,0.864198,0.275862,0.780488,1.000000,0.851852,0.373333,0.510638
7,0.746269,0.328947,0.135802,0.938272,0.080460,0.963415,0.575758,1.000000,0.013333,0.489362

**39\.** Как получить конкретную группу из датафрейма сгруппированного по ключу? (★★★)

Сгруппируйте по 'name', и выведите данные по группе 'orange'.

(hint: groupby(), get_group())

In [353]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df.groupby('name').get_group('orange')

     name     taste  price
2  orange  0.597312     10
5  orange  0.013184     11
8  orange  0.698092      3

**40\.** Как вычислить среднее значение по столбцу 'price' по каждому фрукту в датафрейме и сохранить сгруппированный столбец как другой столбец (не индекс)? (★★★)

In [354]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})


df.join(df.groupby('name')['price'].mean(), on='name', rsuffix='_mean')

     name     taste  price  price_mean
0   apple  0.193120     12   10.000000
1  banana  0.730207      5    5.666667
2  orange  0.975881     13    9.000000
3   apple  0.616596      6   10.000000
4  banana  0.110594      0    5.666667
5  orange  0.152581     12    9.000000
6   apple  0.150372     12   10.000000
7  banana  0.751700     12    5.666667
8  orange  0.482864      2    9.000000

**41\.** Как объединить два датафрейма по двум столбцам, чтобы в них остались только общие строки?  (★★★)

Сделать merge двух датафреймов по колонкам ['fruit', 'weight'] и ['pazham', 'kilo'].

(hint: pd.merge https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#merge )

In [355]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

df1.merge(df2, left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'])

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high       12   apple  high       13
1   apple   high        0   apple  high       13
2   apple   high        8   apple  high       13
3  orange    low        1  orange   low       14
4  orange    low        4  orange   low       14
5  orange    low        1  orange   low       14

**42\.** Как удалить строки из датафрейма А, которые присутствуют в датафрейме B? (★★★)

In [356]:
df1 = pd.DataFrame({'fruit': ['apple', 'orange', 'banana'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.arange(9)})

df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'medium'] * 3,
                    'price': np.arange(6)})

df1[~df1.isin(df2).all(1)]

    fruit  weight  price
2  banana     low      2
3   apple    high      3
4  orange  medium      4
5  banana     low      5
6   apple    high      6
7  orange  medium      7
8  banana     low      8

**43\.** Как получить номера строк, в которых совпадают значения двух столбцов? (★★★)

(hint: np.where)

In [357]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})


print(df[df['fruit1'] == df['fruit2']].index)
df

Int64Index([1, 3, 5, 8], dtype='int64')

   fruit1  fruit2
0  banana   apple
1  banana  banana
2  banana   apple
3  banana  banana
4   apple  orange
5  orange  orange
6  banana   apple
7  orange   apple
8   apple   apple
9   apple  banana

**44\.** Создайте столбец a_shift со сдвигом на одну строку назад. (★★★)

(hint: .shift())

In [358]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

df['a_shift'] = df['a'].shift(periods=-1)
df

    a   b   c   d  a_shift
0  44  56  18  54     31.0
1  31  17  49  34      1.0
2   1  54  19  41      8.0
3   8  56  66  44     17.0
4  17  31  30   6      NaN

**45\.** Как разбить текстовый столбец на три отдельных столбца? (★★★)

Разбить на три столбцы STD, City, State

In [359]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

df = df.row.str.split(r", |    ", expand=True)
df.columns = df.iloc[0]
df = df.shift(-1).dropna()
df

0 STD       City        State
0  33    Kolkata  West Bengal
1  44    Chennai   Tamil Nadu
2  40  Hyderabad    Telengana
3  80  Bangalore    Karnataka

### **46\.** Ну а теперь все вместе.  (★★★★★★★★★★)

* Заменяем все точки в названии на '_'
* Выделить категориальные признаки
* Посчитать кол-во уникальных значений во всех текстовых\категориальных столбцах. 
* Колонки с только уникальными значениями удаляем (например Model и Make)
* Для столбцов у которых значений более 10, оставляем топ 10 значений, остальные заменяем на 'other'
* Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце
* Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.
* Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'
* Все категориальные признаки превращаем в one-hot-encoding
* Создать новый столбец Length_Width = Length * Width
* Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785)  / (MPG * 1,609)
* Посчитать среднюю цену по каждому типу машины у каждого производителя
* Посчитать максимальные Length и Width по Type
* Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)
* Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)
* Посчитать кол-во машин по Manufacturer-Man_trans_avail
* Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам

In [398]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

In [399]:
# Заменяем все точки в названии на '_'
df.columns = df.columns.str.replace('.', '_')
df

<ipython-input-399-ff51befff5e3>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.replace('.', '_')

,Manufacturer,Model,Type,Min_Price,Price,...,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

In [400]:
# Выделить категориальные признаки
c = df.dtypes == 'object'
print(c.index)
categorial = df[c[c].index]
categorial

Index(['Manufacturer', 'Model', 'Type', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

,Manufacturer,Model,Type,AirBags,DriveTrain,Cylinders,Man_trans_avail,Origin,Make
0,Acura,Integra,Small,None,Front,4,Yes,non-USA,Acura Integra
1,NaN,Legend,Midsize,Driver & Passenger,Front,6,Yes,non-USA,Acura Legend
2,Audi,90,Compact,Driver only,Front,6,Yes,non-USA,Audi 90
3,Audi,100,Midsize,Driver & Passenger,NaN,6,NaN,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,Rear,4,Yes,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,None,Front,5,Yes,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,None,Front,4,Yes,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,None,Front,6,Yes,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,Driver only,Rear,NaN,Yes,non-USA,Volvo 240
92,NaN,850,Midsize,Driver & Passenger,Front,5,Yes,non-USA,Volvo 850

In [401]:
# Посчитать кол-во уникальных значений во всех текстовых\категориальных столбцах.
df.nunique()

Manufacturer      31
Model             92
Type               6
Min_Price         72
Price             80
                  ..
Rear_seat_room    24
Luggage_room      16
Weight            75
Origin             2
Make              90
Length: 27, dtype: int64

In [402]:
# Колонки с только уникальными значениями удаляем (например Model и Make)
# df = df[df.columns[~(df.nunique() == df.count())]]
df = df.drop(columns = ['Make','Model'])
c = c.drop(['Make','Model'])
c

Manufacturer       True
Type               True
Min_Price         False
Price             False
Max_Price         False
                  ...
Turn_circle       False
Rear_seat_room    False
Luggage_room      False
Weight            False
Origin             True
Length: 25, dtype: bool

In [403]:
# Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце
numbers = df.select_dtypes(include=['float64'])
numbers.isna().apply(lambda x: x.sum() / len(df))

Min_Price         0.075269
Price             0.021505
Max_Price         0.053763
MPG_city          0.096774
MPG_highway       0.021505
                    ...
Width             0.064516
Turn_circle       0.053763
Rear_seat_room    0.043011
Luggage_room      0.204301
Weight            0.075269
Length: 18, dtype: float64

In [404]:
#Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.
for x in numbers:
  q5, q95 = np.nanquantile(df[x], [0.05, 0.95])
  df.loc[(df[x] < q5), x] = q5
  df.loc[(df[x] > q95), x] = q95
df

,Manufacturer,Type,Min_Price,Price,Max_Price,...,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin
0,Acura,Small,12.9,15.9,18.800,...,37.0,26.5,NaN,2705.0,non-USA
1,NaN,Midsize,29.2,33.9,38.385,...,38.0,30.0,15.0,3560.0,non-USA
2,Audi,Compact,25.9,29.1,32.300,...,37.0,28.0,14.0,3375.0,non-USA
3,Audi,Midsize,NaN,36.9,38.385,...,37.0,31.0,17.0,3405.0,non-USA
4,BMW,Midsize,NaN,30.0,NaN,...,39.0,27.0,13.0,3640.0,non-USA
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Van,16.6,19.7,22.700,...,38.0,32.7,NaN,3960.0,NaN
89,Volkswagen,Compact,17.6,20.0,22.400,...,35.0,31.5,14.0,2985.0,non-USA
90,Volkswagen,Sporty,22.9,23.3,23.700,...,36.0,26.0,15.0,2810.0,non-USA
91,Volvo,Compact,21.8,22.7,23.500,...,37.0,29.5,14.0,2985.0,non-USA
92,NaN,Midsize,24.8,26.7,28.500,...,38.0,30.0,15.0,3245.0,non-USA

In [405]:
# Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'
numbers = numbers.fillna(numbers.mean())
categorial = categorial.fillna('other')

In [406]:
# Все категориальные признаки превращаем в one-hot-encoding
pd.get_dummies(df, columns=c.index)

,Manufacturer_Acura,Manufacturer_Audi,Manufacturer_BMW,Manufacturer_Buick,Manufacturer_Cadillac,...,Weight_3950.0,Weight_3960.0,Weight_3990.0,Origin_USA,Origin_non-USA
0,1,0,0,0,0,...,0,0,0,0,1
1,0,0,0,0,0,...,0,0,0,0,1
2,0,1,0,0,0,...,0,0,0,0,1
3,0,1,0,0,0,...,0,0,0,0,1
4,0,0,1,0,0,...,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
88,0,0,0,0,0,...,0,1,0,0,0
89,0,0,0,0,0,...,0,0,0,0,1
90,0,0,0,0,0,...,0,0,0,0,1
91,0,0,0,0,0,...,0,0,0,0,1
92,0,0,0,0,0,...,0,0,0,0,1

In [407]:
# Создать новый столбец Length_Width = Length * Width
df['Length_Width'] = df['Length'] * df['Width']
df

,Manufacturer,Type,Min_Price,Price,Max_Price,...,Rear_seat_room,Luggage_room,Weight,Origin,Length_Width
0,Acura,Small,12.9,15.9,18.800,...,26.5,NaN,2705.0,non-USA,12036.0
1,NaN,Midsize,29.2,33.9,38.385,...,30.0,15.0,3560.0,non-USA,13845.0
2,Audi,Compact,25.9,29.1,32.300,...,28.0,14.0,3375.0,non-USA,12060.0
3,Audi,Midsize,NaN,36.9,38.385,...,31.0,17.0,3405.0,non-USA,NaN
4,BMW,Midsize,NaN,30.0,NaN,...,27.0,13.0,3640.0,non-USA,12834.0
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Van,16.6,19.7,22.700,...,32.7,NaN,3960.0,NaN,13464.0
89,Volkswagen,Compact,17.6,20.0,22.400,...,31.5,14.0,2985.0,non-USA,12060.0
90,Volkswagen,Sporty,22.9,23.3,23.700,...,26.0,15.0,2810.0,non-USA,10652.4
91,Volvo,Compact,21.8,22.7,23.500,...,29.5,14.0,2985.0,non-USA,12730.0
92,NaN,Midsize,24.8,26.7,28.500,...,30.0,15.0,3245.0,non-USA,12696.0

In [408]:
# Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785)  / (MPG * 1,609)
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df.columns = df.columns.str.replace('.', '_')

df['LPG_city'] = (100 * 3.785) / (df['MPG_city'] * 1.609)
df['LPG_highway'] = (100 * 3.785) / (df['MPG_highway'] * 1.609)

df = df.drop(['MPG_city', 'MPG_highway'], 1)
df

<ipython-input-408-a11cbf74ad27>:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.replace('.', '_')

,Manufacturer,Model,Type,Min_Price,Price,...,Weight,Origin,Make,LPG_city,LPG_highway
0,Acura,Integra,Small,12.9,15.9,...,2705.0,non-USA,Acura Integra,9.409571,7.588364
1,NaN,Legend,Midsize,29.2,33.9,...,3560.0,non-USA,Acura Legend,13.068849,9.409571
2,Audi,90,Compact,25.9,29.1,...,3375.0,non-USA,Audi 90,11.761964,9.047665
3,Audi,100,Midsize,NaN,37.7,...,3405.0,non-USA,Audi 100,12.381015,9.047665
4,BMW,535i,Midsize,NaN,30.0,...,3640.0,non-USA,BMW 535i,10.692695,7.841309
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,3960.0,NaN,Volkswagen Eurovan,13.837605,11.201870
89,Volkswagen,Passat,Compact,17.6,20.0,...,2985.0,non-USA,Volkswagen Passat,11.201870,7.841309
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,2810.0,non-USA,Volkswagen Corrado,13.068849,9.409571
91,Volvo,240,Compact,21.8,22.7,...,2985.0,non-USA,Volvo 240,11.201870,8.401403
92,NaN,850,Midsize,24.8,26.7,...,3245.0,non-USA,Volvo 850,11.761964,8.401403

In [409]:
# Посчитать среднюю цену по каждому типу машины у каждого производителя
df.groupby(['Type', 'Manufacturer'])[['Min_Price', 'Price', 'Max_Price']].mean()

                      Min_Price  Price  Max_Price
Type    Manufacturer
Compact Audi              25.90   29.1      32.30
        Chevrolet          9.95   12.4      14.85
        Chrysler          14.50   15.8      17.10
        Dodge             11.90   13.3      14.70
        Ford              10.40   11.3      12.20
...                         ...    ...        ...
Van     Mazda             16.60   19.1      21.70
        Nissan            16.70   19.1      21.50
        Oldsmobile        19.50   19.5      19.50
        Toyota              NaN   22.7      26.60
        Volkswagen        16.60   19.7      22.70

[75 rows x 3 columns]

In [410]:
# Посчитать максимальные Length и Width по Type
df.groupby(['Type'])['Length','Width'].max()

<ipython-input-410-0f86b9a42aff>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['Type'])['Length','Width'].max()

         Length  Width
Type
Compact   190.0   69.0
Large     219.0   78.0
Midsize   205.0   74.0
Small     177.0   68.0
Sporty    193.0   74.0
Van       194.0   78.0

In [411]:
# Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)
df.groupby(['Type','AirBags']).Manufacturer.count()

Type     AirBags
Compact  Driver & Passenger    2
         Driver only           8
         None                  4
Large    Driver & Passenger    3
         Driver only           7
                              ..
Sporty   Driver & Passenger    2
         Driver only           7
         None                  2
Van      Driver only           3
         None                  6
Name: Manufacturer, Length: 15, dtype: int64

In [412]:
# Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)
df.groupby(['Type','Manufacturer']).Model.count()

Type     Manufacturer
Compact  Audi            1
         Chevrolet       2
         Chrysler        1
         Dodge           1
         Ford            1
                        ..
Van      Mazda           1
         Nissan          1
         Oldsmobile      1
         Toyota          1
         Volkswagen      1
Name: Model, Length: 75, dtype: int64

In [413]:
# Посчитать кол-во машин по Manufacturer-Man_trans_avail
df.groupby(['Man_trans_avail', 'Manufacturer']).Model.count()

Man_trans_avail  Manufacturer
No               Buick           4
                 Cadillac        2
                 Chevrolet       4
                 Chrysler        2
                 Dodge           2
                                ..
Yes              Subaru          3
                 Suzuki          1
                 Toyota          3
                 Volkswagen      4
                 Volvo           1
Name: Model, Length: 41, dtype: int64

In [414]:
# Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.groupby(['Manufacturer','Model']).Passengers.max().sort_values(ascending=False).index[0]

('Chevrolet', 'Astro')

**47\.** Перевести индексы первого и третьего уровня в колонки

In [415]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

In [416]:
df1.reset_index(level=[0, 2])

            t_id class            name date_of_birth  weight
school_code
s001          t1     V  Alberto Franco    15/05/2002      35
s002          t2     V    Gino Mcneill    17/05/2002      32
s003          t3    VI     Ryan Parkes    16/02/1999      33
s001          t4    VI    Eesha Hinton    25/09/1998      30
s002          t5     V    Gino Mcneill    11/05/2002      31
s004          t6    VI    David Parkes    15/09/1997      32

**48\.** Вывести строку из Series и DataFrame по заданному индексу

In [417]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})

indx = 4

print(ds[indx])
print(df.iloc[indx])

9
school_code              s002
class                       V
name             Gino Mcneill
date_of_birth      11/05/2002
weight                     31
Name: 4, dtype: object

**49\.** Найти индексы строк с пропущенными данными

In [418]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN

In [419]:
df[df.isna().any(1)].index

Index(['t2', 't6'], dtype='object')

**50\.** Сделать left join датафреймов

In [420]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

data1.join(data2, how='left', lsuffix="_xXx_.'|'._data2_.'|'._xXx_")

,key1_xXx_.'|'._data2_.'|'._xXx_,key2_xXx_.'|'._data2_.'|'._xXx_,P,Q,key1,key2,R,S
0,K0,K0,P0,Q0,K0,K0,R0,S0
1,K0,K1,P1,Q1,K1,K0,R1,S1
2,K1,K0,P2,Q2,K1,K0,R2,S2
3,K2,K1,P3,Q3,K2,K0,R3,S3

**51\.** Соединить два датафрейма

In [421]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

pd.concat((data1, data2), 1)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

**52\.** Сгруппировать датафрейм по полям 'customer_id' и 'salesman_id' и отсортировать по sum of purch_amt внутри каждой группы

In [422]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

df.groupby(['customer_id', 'salesman_id']).purch_amt.sum().sort_values()

customer_id  salesman_id
3005         5007             75.29
3001         5003            110.50
             5005            270.65
             5002            400.95
3005         5002            948.50
3001         5006           1983.43
             5001           2400.60
3005         5003           2480.40
             5001           8870.86
Name: purch_amt, dtype: float64

**53\.** Сгруппировать датафрейм по месяцу и году из даты ord_date и найти общее количество заказов по годам и по месяцам

In [423]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

df['year'] = pd.to_datetime(df.ord_date).dt.year
df['month'] = pd.to_datetime(df.ord_date).dt.month
df.groupby(['month', 'year']).ord_no.count()

month  year
4      2012    1
5      2012    1
       2013    1
6      2014    1
7      2012    1
       2014    1
8      2013    1
9      2012    1
10     2012    3
       2013    1
Name: ord_no, dtype: int64

# Regular expressions with Pandas

**1\.** Выделить в отдельную колонку event_id первую цифру в кавычках, во вторую колонку event_probability вероятность (★☆☆)

In [424]:
import re

In [425]:
df=pd.DataFrame({'col1':["{'34': 0.9839372122311848}",
                         "{'77': 0.6724645988404411}",
                         "{'77': 0.6491011266207006}",
                         "{'77': 0.6123085784265466}",
                         "{'34': 0.87}",
                         "{'77': 0.6225699652019304}",
                         "{'3': 0.5470808226524633}",
                         "{'77': 0.6233849004135044}",
                         "{'77': 0.7050888998743866}",
                         "{'52': 0.8945052223205372}"]})

df['event_id'] = df['col1'].str[2]
df['event_probability'] = df['col1'].str.strip(' }').str.split(':').str[1]
df

                         col1 event_id    event_probability
0  {'34': 0.9839372122311848}        3   0.9839372122311848
1  {'77': 0.6724645988404411}        7   0.6724645988404411
2  {'77': 0.6491011266207006}        7   0.6491011266207006
3  {'77': 0.6123085784265466}        7   0.6123085784265466
4                {'34': 0.87}        3                 0.87
5  {'77': 0.6225699652019304}        7   0.6225699652019304
6   {'3': 0.5470808226524633}        3   0.5470808226524633
7  {'77': 0.6233849004135044}        7   0.6233849004135044
8  {'77': 0.7050888998743866}        7   0.7050888998743866
9  {'52': 0.8945052223205372}        5   0.8945052223205372

**2\.** Удалите все тэги, переносы строк из текстов новостей (★★★)

(hint: df.column.str())

In [426]:
df = pd.read_excel('news.xlsx')

df

                                                 text
0   <html>\n <body>\n  <p>\n   Сообщение о существ...
1   <html>\n <body>\n  <p>\n   <mark-inn class="{5...
2   <html>\n <body>\n  <p>\n   <mark-sentence clas...
3   <html>\n <body>\n  <h3 id="header">\n   Самарс...
4   <html>\n <body>\n  <p>\n   <mark-sentence clas...
..                                                ...
15  <html>\n <body>\n  <p>\n   <span class="articl...
16  <html>\n <body>\n  <p>\n   дата: on источник:\...
17  <html>\n <body>\n  <p>\n   <mark-inn>\n    НУР...
18  <html>\n <body>\n  <p>\n   <mark-inn>\n    Sam...
19  <html>\n <body>\n  <p>\n   В администрации Кра...

[20 rows x 1 columns]

In [427]:
df.text = df.text.str.replace(r'<.+>|\n', '')
df

<ipython-input-427-03c87510ad12>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.text = df.text.str.replace(r'<.+>|\n', '')

                                                 text
0         Сообщение о существенном факте         о...
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...
2             УЛЬЯНОВСК, 3 декабря 2019, 11:38 - R...
3         Самарская область признана одним из лиде...
4             Окружная администрация Якутска подпи...
..                                                ...
15                 София        ,         4 декабр...
16        дата: on источник:       Управление по с...
17            НУР-СУЛТАН      .       КАЗИНФОРМ   ...
18            Samsung Heavy Industries      постав...
19        В администрации Краснодарского края подв...

[20 rows x 1 columns]

**3\.** Проставьте флаг в колонку source_ria если текст новости содержит: риа новости, тасс, коммерсант. Перед поиском переведите тексты в lower и удалите все кроме букв. Данные после чистки из предыдушего задания (★★★)

(hint: df.column.str())

In [428]:
txt = df['text']
txt = txt.str.lower().replace('[\d.!?\-,:"/—–]', '', regex=True)
df['source_ria '] = txt.str.findall('(риа новости)|(тасс)|(коммерсант)').str.len() > 0
df

                                                 text  source_ria
0         Сообщение о существенном факте         о...        False
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...        False
2             УЛЬЯНОВСК, 3 декабря 2019, 11:38 - R...        False
3         Самарская область признана одним из лиде...        False
4             Окружная администрация Якутска подпи...        False
..                                                ...          ...
15                 София        ,         4 декабр...        False
16        дата: on источник:       Управление по с...        False
17            НУР-СУЛТАН      .       КАЗИНФОРМ   ...        False
18            Samsung Heavy Industries      постав...         True
19        В администрации Краснодарского края подв...        False

[20 rows x 2 columns]

**4\.** Отфильтруйте строки с валидными емейлами (★★★)

In [429]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com', 'kek lol@mail.ru'])

emails[emails.apply(lambda x: bool(re.fullmatch(r'\w{1,}@[a-z]{1,}\.*(com|co|ru)', x)))]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

**5\.** Напишите паттерн для поиска строки содержащей только буквы в верхнем и нижнем регистре, цифры и подчеркивание

In [430]:
print(re.fullmatch('\w+', 'Жил без страха и умер без страха'))
print(re.fullmatch('\w+', 'Жилбезстрахаиумер_без_страха'))

None
<re.Match object; span=(0, 28), match='Жилбезстрахаиумер_без_страха'>

**6\.** Замените пробелы на подчеркивание и наоборот

In [431]:
s = " a s ddff_d_ "

s.replace(r'_', ' ')
s.replace(r' ', '_')

'_a_s_ddff_d__'

**7\.** Найдите слова длиной 3,4,5

In [432]:
s = 'Жил без страха и умер без страха'
re.findall(r'\s*([a-zA-Zа-яА-ЯёЁ]{3,5})\s{1,}', s)

['Жил', 'без', 'траха', 'умер', 'без']

**8\.** Сделайте регистронезависимую замену(replace) во входной строке

In [433]:
re.sub('жил', 'ААААААААААААААААААААААААААА', s, flags=re.IGNORECASE)

'ААААААААААААААААААААААААААА без страха и умер без страха'